# Brewfile for dotfiles2
# Run with: brew bundle

# Taps
tap "homebrew/cask"

# Formulae (brew packages)
brew "autoconf"
brew "automake"
brew "aws-iam-authenticator"
brew "awscli"
brew "byobu"
brew "coreutils"
brew "curl"
brew "eksctl"
brew "gdbm"
brew "gh"
brew "git"
brew "grep"
brew "helm"
brew "htop"
brew "icdiff"
brew "jenv"
brew "jq"
brew "kube-ps1"
brew "kubectl"
brew "kubectx"
brew "kustomize"
brew "libyaml"
brew "mecab"
brew "mecab-ipadic"
brew "mosh"
brew "mysql@8.0"
brew "neovim"
brew "node-build"
brew "nodenv"
brew "openssl@3"
brew "packer"
brew "pcre"
brew "peco"
brew "pkg-config"
brew "postgresql"
brew "postgresql@14"
brew "python"
brew "readline"
brew "redis"
brew "screen"
brew "sqlite"
brew "ssh-copy-id"
brew "sshfs-mac"
brew "stern"
brew "subversion"
brew "telepresence-legacy"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "torsocks"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"

# Casks (GUI applications)
cask "chromedriver"
cask "docker"
cask "docker-desktop"
cask "firefox"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "gyazo"
cask "hyperswitch"
cask "iterm2"
cask "kindle"
cask "macfuse"
cask "phantomjs"
cask "skitch"
cask "skype"
cask "sourcetree"
cask "stats"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "xquartz"
